// Чисто виртуальный деструктор 106.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

using namespace std;

class A
{

public:

    A()
    {
        cout << "Имитация. Выделена динамическая память под объект класса А" << endl;
    }
    virtual ~A() = 0;
};
A::~A() 
{
    cout << "Имитация. Освобождена динамическая память из-под объекта класса А" << endl;
};

class B : public A
{

public:
    B()
    {
        cout << "Имитация. Выделена динамическая память под объект класса B" << endl;
    }
    ~B() override
    {
        cout << "Имитация. Освобождена динамическая память из-под объекта класса B" << endl;
    }
};

int main()
{
    setlocale(0, "rus");
    
    A* ptrB = new B; // Несмотря на то, что Класс А - абстрактный, можно создать указатель с его типом данных
    delete ptrB;

    // A a; Класс А - абстрактный, т.к. имеет чисто виртуальный деструктор => объект класса создать нельзя

    return 0;
}
